---
kind: type
id: T:Autodesk.Revit.UI.IDropHandler
source: html/758b284b-0d5f-c8d8-ea13-ed2e4d89eb88.htm
---
# Autodesk.Revit.UI.IDropHandler

An interface to be executed when custom data is dragged and dropped onto the Revit user interface.

## Syntax (C#)
```csharp
public interface IDropHandler
```

## Remarks
Custom data is supported for drag and drop only during an invocation of the DoDragDrop method on Application.